[
    {
        "id" : "0",
        "topic" : "Loops, Conditional Statements, Function ,etc",
        "question" : "Write a guessing game where the user has to guess a secret number. After every guess the program tells the user whether their number was too large or too small. At the end the number of tries needed should be printed. It counts only as one try if they input the same number multiple times consecutively."
    },
    {
        "id" : "1",
        "topic" : "Array & Function",
        "question" : "Write function that reverses a array, preferably in place."
    },
    {
        "id" : "2",
        "topic" : "Strings & Function",
        "question" : "Write a function that tests whether a string is a palindrome."
    },
    {
        "id" : "3",
        "topic" : "Function",
        "question" : "Write a function that tests whether a number is a palindrome."
    },
    {
        "id" : "4",
        "topic" : "Loops, Conditional Statements, Function ,etc",
        "question" : "Write a function on_all that applies a function to every element of a array. Use it to print the first twenty perfect squares. The perfect squares can be found by multiplying each natural number with itself. The first few perfect squares are 1*1= 1, 2*2=4, 3*3=9, 4*4=16. Twelve for example is not a perfect square because there is no natural number m so that m*m=12."
    },
    {
        "id" : "5",
        "topic" : "Array & Function",
        "question" : "Write a function that combines two arrays by alternatingly taking elements, e.g. [a,b,c], [1,2,3] → [a,1,b,2,c,3]."
    },
    {
        "id" : "6",
        "topic" : "Array & Function",
        "question" : "Write a function that takes a number and returns a array of its digits. So for 2342 it should return [2,3,4,2]."
    },
    {
        "id" : "7",
        "topic" : "Array & Function",
        "question" : "Write a function that rotates a array by k elements. For example [1,2,3,4,5,6] rotated by two becomes [3,4,5,6,1,2]. Try solving this without creating a copy of the array. How many swap or move operations do you need?"
    },
    {
        "id" : "8",
        "topic" : "Conditional Statements & Function",
        "question" : "Write functions that add, subtract, and multiply digits of two numbers."
    },
    {
        "id" : "9",
        "topic" : "Loops, Conditional Statements, Function ,etc",
        "question" : "Implement binary search."
    },
    {
        "id" : "10",
        "topic" : "Array & Function",
        "question" : "Write a function that takes a array of strings an prints them, one per line, in a rectangular frame. For example the list ["Hello", "World", "in", "a", "frame"] gets printed as:

        *********
        * Hello *
        * World *
        * in    *
        * a     *
        * frame *
        *********"
    },
    {
        "id" : "11",
        "topic" : "Array & Function",
        "question" : "Print the following pattern without using print in-built function.
        i.      ii.     iii.    iv.
        *       ***       *     ***
        **      **       **      **
        ***     *       ***       *
        
        v.      ii.     iii.    iv.
        1       123       1     123
        23      45       23      45
        456     5       456       6"
    },
    {
        "id" : "12",
        "topic" : "Loops, Conditional Statements, Function ,etc",
        "question" : "Convert Age -> Days (Consider leap years in between) take year of birth as input also."
    },
    {
        "id" : "13",
        "topic" : "Loops, Conditional Statements, Function ,etc",
        "question" : "Create a function that finds the maximum range of a triangle's third edge, where the side lengths are all integers. Note. (side1 + side2) - 1 = maximum range of third edge."
    },
    {
        "id" : "14",
        "topic" : "Array & Function",
        "question" : "Write a function that takes number K where is smaller than size of array, we need to find the Kth smallest and largest elementin the given array.It is given that all array elements are not distinct and If not present return -1."
    }
]